# toneypal - Antonina Palchikova

# Задача-1: поработайте с переменными, создайте несколько,
# выведите на экран, запросите от пользователя и сохраните в переменную, выведите на экран

value_int = 1
value_str = 'stroka'
value_float = 10.5
value_list = [value_int, value_str, value_float]

print(value_float)
print("value_float = ", value_float)
print("value_str = ", value_str)
print("value_int = ", value_int)
print("value_list:", value_list)

print("Введите что-нибудь:")
user_input = input()

print("Вы ввели:" + user_input)